package basic_01.chapter_08;

/**
 * @author scz
 */
public class summary {
    /*


    1.哪些情况不会产生多态？

        1。只有普通的方法可以是多态的。
        2。private无法进行多态
        3。域无法进行多态
        4。静态函数无法进行多态
        5。final方法无法进行多态

        6。java尽量使用子类覆盖的方法
        7。如果子类能够覆盖父类的方法，在进行向上转型的时候，在需要调用的时候，会调用子类覆盖的方法。
        8。如果子类不能够覆盖父类的方法（以上几种情况），在进行向上转型的时候，在需要调用的时候，会调用父类所使用的方法。

        也就是，
        首先要搞清楚哪些情况不能进行多态
        其次知道java是尽可能最大程度使用派生类的方法
        就ok。

    2.对于静态，动态绑定的理解。

    见 有关静态绑定和动态绑定.md 文档












     */


}



